console.log('----------------Зробіть 1 і 2 рівень code.mu задачника (з рівень 1.1 по 2.10 включно):----------------------');


console.log('---------------РІВЕНЬ 1----------------');

console.log('---------------------------------------');
console.log('---------------РІВЕНЬ 1.1----------------');
console.log('Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль.');

let a1 = 5;

if (a1 >= 0) {
    console.log('Число є додатнім');    
} else {
    console.log('Число є від\'ємним');
    
}

console.log('---------------РІВЕНЬ 1.2----------------');

console.log('Дана строка. Выведите в консоль длину этой строки.');

let a2 = 'Hello, world! Good Day!';

console.log('Строка =>', a2, 'має довжину', a2.length);

console.log('---------------РІВЕНЬ 1.3----------------');

console.log('Дана строка. Выведите в консоль последний символ строки.');

let a3 = 'I am good men';
let lastEl = a3.charAt(a3.length-1);
console.log('Маємо строку =>', a3, 'останній єлемент якої', lastEl);



console.log('---------------РІВЕНЬ 1.4----------------');
console.log('Дано число. Проверьте, четное оно или нет.');

let a4 = 6;

if(a4 % 2===0) {
    console.log('Маємо парне число');
} else {
    console.log('Маємо Непарне число');
}


console.log('---------------РІВЕНЬ 1.5----------------');

console.log('Даны два слова. Проверьте, что первые буквы этих слов совпадают.');

let word1 = 'Hollywood';
let word2 = 'House';

let firsLetter1 = word1.charAt(0);
let firsLetter2 = word2.charAt(0);

if (firsLetter1===firsLetter2) {
    console.log('Перші літери слів співпадають');    
} else {
    console.log('Перші літери слів не співпадають'); 
}


console.log('---------------РІВЕНЬ 1.6----------------');

console.log('Дано слово. Получите его последнюю букву. Если слово заканчивается на мягкий знак, то получите предпоследнюю букву.');

let a6 = 'Стілець';
let lastLetter = a6.charAt(a6.length-1);

if (lastLetter ==='ь') {
    let preLastLetter = a6.charAt(a6.length-2);
    console.log(preLastLetter);
    
} else {
    console.log(lastLetter);
}

console.log('---------------------------------------');


console.log('---------------РІВЕНЬ 2----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 2.1----------------');

console.log('Дано число. Выведите в консоль первую цифру этого числа.');

let b1 = 450;
let firstNumber = Number(String(b1)[0]);
console.log('Перша цифра числа', b1, 'дорівнює', firstNumber);


console.log('---------------РІВЕНЬ 2.2----------------');

console.log('Дано число. Выведите в консоль последнюю цифру этого числа.');

let b2 = 1345345;
let lastNumber = b2 % 10;
console.log('Остання цифра числа', b2, 'дорівнює',  lastNumber);


console.log('---------------РІВЕНЬ 2.3----------------');

console.log('Дано число. Выведите в консоль сумму первой и последней цифры этого числа.');

let b3 = 454465;

let firstb3 = Number(String(b3)[0]);
let lastb3 = b3 % 10;

let sumb3 = firstb3 + lastb3;
console.log('Сума першої і останньої цифри для числа', b3,  'дорівнює',  sumb3);


console.log('---------------РІВЕНЬ 2.4----------------');

console.log('Дано число. Выведите количество цифр в этом числе.');

let b4 = 4534;

let countOfNumber = b4.toString().length;

console.log(countOfNumber);


console.log('---------------РІВЕНЬ 2.5----------------');

console.log('Даны два числа. Проверьте, что первые цифры этих чисел совпадают.');

let num1 = 3456;
let num2 = 32456;

let firstNum1 = Number(String(num1)[0]);
let firstNum2 = Number(String(num2)[0]);

if (firstNum1 ===firstNum2) {
    console.log('Перші цифри чисел', num1, 'та', num2, 'співпадають');    
} else {
    console.log('Перші цифри чисел', num1, 'та', num2, 'не співпадають');
}


console.log('---------------------------------------');



console.log('---------------РІВЕНЬ 3----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 3.1----------------');

console.log('Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.');

let c1 = 'Supermen'

if (c1.length > 1) {
    let sim1 = c1.charAt(c1.length-2);
    console.log('Передостанній елемент у стрічці', c1, 'це', sim1); 

} else {
    console.log('У строці лише один символ');
    
}

console.log('---------------РІВЕНЬ 3.2----------------');


const numberOne = 16;
const numberTwo = 8;

let c2 = numberOne % numberTwo;

console.log('Число', numberOne, 'ділиться без залишку на число', numberTwo, 'тому що результат операції ділення по модулю дорівнює', c2);


console.log('---------------------------------------');


console.log('---------------РІВЕНЬ 4----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 4.1----------------');

console.log('Выведите в консоль все целые числа от 1 до 100');


console.log('Виводимо усі цілі числа від 1 до 100:');


for (let d1 = 1; d1<=100; d1++) {
    console.log(d1);
    
}

console.log('---------------РІВЕНЬ 4.2----------------');

console.log('Выведите в консоль все целые числа от -100 до 0.');

console.log('Виводимо усі цілі числа від -100 до 0:');


for (let d2 = -100; d2<=0; d2++) {
    console.log(d2);
    
}


console.log('---------------РІВЕНЬ 4.3----------------');

console.log('Выведите в консоль все целые числа от 100 до 1');

console.log('Виводимо усі цілі числа від 100 до 1:');


for (let d3 = 100; d3>=1; d3--) {
    console.log(d3);
    
}

console.log('---------------РІВЕНЬ 4.4----------------');

console.log('Выведите в консоль все четные числа из промежутка от 1 до 100.');


console.log('Виводимо усі парні числа від 1 до 100:');


for (let d4 = 1; d4<=100; d4++) {
    
    if (d4 % 2 ===0) {
        console.log(d4);        
    }
    
}

console.log('---------------РІВЕНЬ 4.5----------------');

console.log('Выведите в консоль все числа кратные трем в промежутке от 1 до 100.');


console.log('Виводимо усі кратні 3 числа від 1 до 100:');


for (let d5 = 1; d5<=100; d5++) {
    
    if (d5 % 3 ===0) {
        console.log(d5);        
    }
    
}


console.log('---------------РІВЕНЬ5----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 5.1----------------');

console.log('Найдите сумму всех целых чисел от 1 до 100.');

let summa = 0;

for (d6 = 1; d6 <=100; d6++) {
    summa += d6;
}

console.log('Сумма цілих чисел від 1 до 100 дорівнює', summa);


console.log('---------------РІВЕНЬ 5.2----------------');

console.log('Найдите сумму всех целых четных чисел в промежутке от 1 до 100.');

let summa2 = 0;

for (d7 = 1; d7 <=100; d7++) {
    
    if (d7 % 2 ===0) {
        summa2 += d7;
    }
}

console.log('Сумма цілих парних чисел від 1 до 100 дорівнює', summa2);



console.log('---------------РІВЕНЬ 5.3----------------');

console.log('Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100.');

let summa3 = 0;

for (d8 = 1; d8 <=100; d8+=2) {
    summa3 +=d8;
}

console.log('Сумма цілих непарних чисел від 1 до 100 дорівнює', summa3);


console.log('---------------РІВЕНЬ 5.4----------------');

console.log('Даны два целых числа. Найдите остаток от деления первого числа на второе.');

let x1 = 45;
let x2 = 4;

let d9 = x1 % x2;

console.log('Залишок від ділення 45 на 4 складає', d9);



console.log('---------------РІВЕНЬ 5.5----------------');

console.log('Дана некоторая строка. Переберите и выведите в консоль по очереди все символы с конца строки.');

let d10 = 'I like ice cream'

for (i = d10.length-1; i>=0; i--) {
    console.log(d10[i]);
    
}

console.log('---------------------------------------');



console.log('---------------РІВЕНЬ6----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 6.1----------------');

console.log('Дан массив с числами. Найдите сумму квадратов элементов этого массива.');

let e1 = [3, 5, 3, 7, 8, 9, 11];

let e1summ = 0;

for (i=0; i < e1.length; i++) {
    e1summ += e1[i] ** 2;
}

console.log('Сума квадратів елементів у массиві', e1, 'дорівнює', e1summ);


console.log('---------------РІВЕНЬ 6.2----------------');

console.log('Дан массив с числами. Найдите сумму квадратных корней элементов этого массива.');

let e2 = [9, 16, 4, 36, 64, 81];

let e2summ = 0;

for (i=0; i < e2.length; i++) {
    e2summ += Math.sqrt(e2[i]);
}

console.log('Сума квадратних коренів елементів у массиві', e2, 'дорівнює', e2summ);



console.log('---------------РІВЕНЬ 6.3----------------');

console.log('Дан массив с числами. Найдите сумму положительных элементов этого массива.');

let e3 = [-3, 2, 5, -5, -7, 6, 4, 9];

let e3summ = 0;

for (i = 0; i < e3.length; i++) {
    if (e3[i] >= 0) {
        e3summ += e3[i];
    }
}

console.log('Сумма додатніх елементів у массиві', e3, 'дорівнює', e3summ);


console.log('---------------РІВЕНЬ 6.4----------------');


console.log('---------------------------------------');

console.log('Дан массив с числами. Найдите сумму тех элементов этого массива, которые больше нуля и меньше десяти.');

let e4 = [3, 15, -5, 17, 2, 43, 56, -100, 9, 8];

let e4summ = 0;

for (i = 0; i < e4.length; i++) {
    if (e4[i] > 0 && e4[i] < 10) {
        e4summ += e4[i];
    }
}

console.log('Сумма елементів від 0 до 10 у массиві', e4, 'дорівнює', e4summ);




console.log('---------------РІВЕНЬ7----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 7.1----------------');

console.log('Дана строка: abcde. Получите массив букв этой строки');

let f1 = 'abcde';

let f1array = [...f1];

console.log(f1array);


console.log('---------------РІВЕНЬ 7.2----------------');


console.log('Дано число: 12345. Получите массив цифр этого числа');

let f2 = 12345;
let f2string = f2.toString();
let f2split = f2string.split('');
let f2array = f2split.map(Number);

console.log(f2array);


console.log('---------------РІВЕНЬ 7.3----------------');

console.log('Дано число: 12345. Переверните его:');

let f3 = 12345;
let f3string = f3.toString();
let f3split = f3string.split('');
let f3reverse = f3split.reverse();
let f3join = Number(f3reverse.join(''));
console.log(f3join);


console.log('---------------РІВЕНЬ 7.4----------------');

console.log('Дано число: 12345. Найдите сумму цифр этого числа.');

let f4 = 12345;
let f4string = f4.toString();
let f4split = f4string.split('');
let f4map = f4split.map(Number);
console.log('Предстваляємо число у вигляді массиву', f4map);

let summf4 = 0;
for (i = 0; i < f4map.length; i++) {
    summf4+=f4map[i];
}
console.log('Обчислюємо суму', summf4);


console.log('---------------------------------------');




console.log('---------------РІВЕНЬ8----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 8.1----------------');

console.log('Заполните массив целыми числами от 1 до 10.');

let g1 = [];
for (let i = 1; i <= 10; i++) {
  g1.push(i);
}
console.log(g1);


console.log('---------------РІВЕНЬ 8.2----------------');

console.log('Заполните массив четными числами из промежутка от 1 до 100.');

let g2 = [];
for (let i = 2; i <= 100; i++) {
  
  if (i % 2 === 0) {  
    g2.push(i);
}

}
console.log(g2);



console.log('---------------РІВЕНЬ 8.3----------------');

console.log('Дан массив с дробями: [1.456, 2.125, 3.32, 4.1, 5.34] Округлите эти дроби до одного знака в дробной части.');

let g3 = [1.456, 2.125, 3.32, 4.1, 5.34];

let drob = g3.map(num => +num.toFixed(1));
console.log(drob);


console.log('---------------------------------------');



console.log('---------------РІВЕНЬ9----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 9.1----------------');

console.log('Дан массив со строками. Оставьте в этом массиве только те строки, которые начинаются на http://.');

let h1 = ['http://site.com', 'dfsdgfdsg', 'http://www.website.net', 'dfsdgfdsg', 'http://amazon.com', 'dfsdgfdsg', 'https://dnk.ua'];

console.log('Беремо масив', h1);

let newH1 = h1.filter(i => i.startsWith("http://"));

console.log('Отримуємо масив', newH1);



console.log('---------------РІВЕНЬ 9.2----------------');

console.log('Дан массив со строками. Оставьте в этом массиве только те строки, которые заканчиваются на .html.');

let h2 = ['http://site.com/index.html', 'dfsdgfdsg', 'http://www.website.net/sitemap.xml', 'dfsdgfdsg', 'http://amazon.com/contact.html', 'dfsdgfdsg', 'https://dnk.ua'];

console.log('Беремо масив', h2);

let newH2 = h2.filter(i => i.endsWith(".html"));

console.log('Отримуємо масив', newH2);



console.log('---------------РІВЕНЬ 9.3----------------');

console.log('Дан массив с числами. Увеличьте каждое число из массива на 10 процентов.');

let h3 = [100, 200, 300, 400, 500];

console.log('Беремо масив', h3);

for (i = 0; i < h3.length; i++) {
    
    h3[i] = h3[i] + (h3[i]/10);
}

console.log('Додаємо 10% до кожного елемента', h3);


console.log('---------------------------------------');




console.log('---------------РІВЕНЬ10----------------');

console.log('---------------------------------------');

console.log('---------------РІВЕНЬ 10.1----------------');

console.log('Заполните массив случайными числами из промежутка от 1 до 100.');

let j1 = [];
for (let i = 0; i < 10; i++) {
    let randomNum = Math.random() * 100;
    let numJ1 = Math.floor(randomNum + 1);
    j1.push(numJ1); 
}
console.log(j1);

console.log('---------------РІВЕНЬ 10.2----------------');

console.log('Дано некоторое число: 12345. Выведите в консоль все его символы с конца.');

let j2 = 12345;

let j2String = j2.toString();

for (i = j2String.length - 1; i >= 0; i--) {
    console.log(j2String[i]);    
}

console.log('---------------РІВЕНЬ 10.3----------------');

console.log('Дан некоторый массив, например, вот такой: [1, 2, 3, 4, 5, 6] По очереди выведите в консоль подмассивы из двух элементов нашего массива: [1, 2] [3, 4] [5, 6]');

j3 =  [1, 2, 3, 4, 5, 6];

for (i = 0; i < j3.length; i +=2) {
    console.log([j3[i], j3[i] +1]);
    
}

console.log('---------------РІВЕНЬ 10.4----------------');

console.log('Даны два массива: let arr1 = [1, 2, 3]; let arr2 = [4, 5, 6]; Слейте эти массивы в новый массив: [1, 2, 3, 4, 5, 6]');

let arr1 = [1, 2, 3];
let arr2 = [4, 5, 6];

let newArray = [...arr1, ...arr2];
console.log(newArray);

console.log('---------------------------------------');